# _*_ coding:UTF-8 _*_
# 开发人员: 理想国真恵玩-张大鹏
# 开发团队: 理想国真恵玩
# 开发时间: 2019-04-11 09:40
# 文件名称: hw_005_判断一个人是否可以结婚.py
# 开发工具: PyCharm

# 需求:判断一个人是否可以领取结婚证
# 1:获取该用户的国籍,性别,年龄
country = input("国籍:")
gender = input("性别:")
age = input("年龄:")
# 2 判断该国该性别的法定结婚年龄
if country == "中国":
    # 中国男人法定结婚年龄22 女20
    if gender == '男':
        if int(age) >= 22:
            print("到了法定结婚年龄")
        else:
            print("年龄未满22岁,未到法定结婚年龄")
    else:
        if int(age) >= 20:
            print("到了法定结婚年龄")
        else:
            print("年龄未满22岁,未到法定结婚年龄")
else:
    print('暂不提供该国法定结婚年龄判定.')
# 3 进行判断并将结果打印
